Repository: licq/litranslator
Catalog: VoiceTranslator/Resources/Localizable.xcstrings
Source language: en
Languages: ar, bg, cs, da, de, el, es, et, fi, fr, hu, id, it, ja, ko, lt, lv, nb, nl, pl, pt_pt, ro, ru, sk, sl, sv, tr, uk, zh_hans, zh_hant

# settings.view.translation.provider.mode
source: Provider
ar: المزود
bg: Доставчик
cs: Poskytovatel
da: Leverandør
de: Anbieter
el: Πάροχος
et: Teenusepakkuja
fi: Palveluntarjoaja
fr: Fournisseur
hu: Szolgáltató
id: Penyedia
it: Fornitore
ja: プロバイダー
ko: 공급자
lt: Teikėjas
lv: Nodrošinātājs
nb: Leverandør
nl: Aanbieder
pl: Dostawca
pt_pt: Fornecedor
ro: Furnizor
ru: Поставщик
sk: Poskytovateľ
sl: Ponudnik
sv: Leverantör
tr: Sağlayıcı
uk: Провайдер
zh_hans: 模式
zh_hant: 提供者

# settings.voice.detection.threshold
source: Voice Silence Threshold
ar: عتبة الصمت الصوتي
bg: Праг на гласовата тишина
cs: Práh ticha hlasu
da: Stemme Tavshedstærskel
de: Schwellenwert für die Stille der Stimme
el: Κατώφλι σιωπής φωνής
es: Umbral de silencio de voz
et: Hääle vaikusekünnis
fi: Äänen hiljaisuuden kynnysarvo
fr: Seuil de silence vocal
hu: Hangcsend küszöbérték
id: Ambang Batas Kesenyapan Suara
it: Soglia del silenzio vocale
ja: ボイス・サイレンス・スレッショルド
ko: 음성 무음 임계값
lt: Balso tylos slenkstis
lv: Balss klusuma slieksnis
nb: Terskelverdi for stillhet
nl: Drempel stemstilte
pl: Próg ciszy głosowej
pt_pt: Limiar de silêncio de voz
ro: Pragul de tăcere a vocii
ru: Порог тишины голоса
sk: Prah ticha hlasu
sl: Prag tišine glasu
sv: Tröskelvärde för tystnad
tr: Ses Sessizliği Eşiği
uk: Поріг мовчання голосу
zh_hans: 声音活动检测阀值
zh_hant: 語音沉默閾值

# settings.voice.detection.threshold.comment
source: The application will consider a paragraph ended and begin the translation process after a pause in sound for a certain duration.
ar: سيعتبر التطبيق الفقرة منتهية ويبدأ عملية الترجمة بعد توقف الصوت لمدة معينة.
bg: Приложението счита даден абзац за завършен и започва процеса на превод след прекъсване на звука за определен период от време.
cs: Aplikace bude považovat odstavec za ukončený a zahájí proces překladu po určitou dobu trvající zvukové pauze.
da: Programmet vil betragte et afsnit som afsluttet og begynde oversættelsesprocessen efter en pause i lyden af en vis varighed.
de: Die Anwendung betrachtet einen Absatz als beendet und beginnt den Übersetzungsprozess nach einer Tonpause von einer bestimmten Dauer.
el: Η εφαρμογή θα θεωρήσει ότι μια παράγραφος έχει τελειώσει και θα ξεκινήσει τη διαδικασία μετάφρασης μετά από μια παύση του ήχου για ορισμένη διάρκεια.
es: La aplicación considerará que un párrafo ha terminado y comenzará el proceso de traducción tras una pausa en el sonido de una duración determinada.
et: Rakendus loeb lõigu lõppenuks ja alustab tõlkeprotsessi pärast teatava kestusega helipausi.
fi: Sovellus katsoo kappaleen päättyneeksi ja aloittaa käännösprosessin, kun ääni on pysähtynyt tietyksi ajaksi.
fr: L'application considérera qu'un paragraphe est terminé et commencera le processus de traduction après une pause sonore d'une certaine durée.
hu: Az alkalmazás egy bekezdést befejezettnek tekint, és egy bizonyos ideig tartó hangszünet után megkezdi a fordítási folyamatot.
id: Aplikasi akan menganggap sebuah paragraf telah berakhir dan memulai proses penerjemahan setelah jeda suara selama durasi tertentu.
it: L'applicazione considererà concluso un paragrafo e inizierà il processo di traduzione dopo una pausa del suono di una certa durata.
ja: このアプリケーションは、段落が終了したとみなし、一定時間音声が途切れた後に翻訳処理を開始します。
ko: 애플리케이션은 단락이 끝난 것으로 간주하고 일정 시간 동안 소리가 일시 정지된 후 번역 프로세스를 시작합니다.
lt: Programa laikys pastraipą baigta ir pradės vertimo procesą po tam tikros trukmės garso pauzės.
lv: Programma uzskatīs, ka punkts ir beidzies, un pēc noteikta ilguma pauzes sāks tulkošanas procesu.
nb: Programmet anser et avsnitt som avsluttet og starter oversettelsesprosessen etter en lydpause av en viss varighet.
nl: De applicatie zal een paragraaf als beëindigd beschouwen en het vertaalproces starten na een geluidspauze van een bepaalde duur.
pl: Aplikacja uzna akapit za zakończony i rozpocznie proces tłumaczenia po przerwie w odtwarzaniu dźwięku przez określony czas.
pt_pt: A aplicação considerará que um parágrafo terminou e iniciará o processo de tradução após uma pausa no som durante um determinado período.
ro: Aplicația va considera că un paragraf s-a încheiat și va începe procesul de traducere după o pauză în sunet de o anumită durată.
ru: Приложение будет считать абзац законченным и начнет процесс перевода после паузы в звуке определенной продолжительности.
sk: Aplikácia bude považovať odsek za ukončený a začne proces prekladu po pauze zvuku na určitú dobu.
sl: Aplikacija bo odstavek štela za zaključenega in začela postopek prevajanja po zvočnem premoru, ki bo trajal določen čas.
sv: Applikationen kommer att betrakta ett stycke som avslutat och påbörja översättningsprocessen efter en paus i ljudet under en viss tid.
tr: Uygulama bir paragrafı bitmiş kabul edecek ve belirli bir süre ses duraklamasından sonra çeviri işlemine başlayacaktır.
uk: Програма вважатиме абзац закінченим і почне процес перекладу після паузи в звучанні певної тривалості.
zh_hans: 应用将在声音停顿时长后认为该段话结束，开始进入翻译过程。
zh_hant: 該應用程序將考慮結束段落，並在聲音中暫停後開始翻譯過程。

source: To provide live audio translation, our app requires access to your microphone. Please grant permission in settings.
ar: لتوفير ترجمة صوتية مباشرة، يتطلب تطبيقنا الوصول إلى الميكروفون الخاص بك. يُرجى منح الإذن في الإعدادات.
bg: За да осигурим аудиопревод на живо, нашето приложение изисква достъп до микрофона ви. Моля, дайте разрешение в настройките.
cs: Aby bylo možné zajistit živý zvukový překlad, vyžaduje naše aplikace přístup k mikrofonu. Povolení udělte v nastavení.
da: For at kunne levere live lydoversættelse kræver vores app adgang til din mikrofon. Giv venligst tilladelse i indstillingerne.
de: Um eine Live-Audioübersetzung anbieten zu können, benötigt unsere App Zugriff auf Ihr Mikrofon. Bitte erteilen Sie die Erlaubnis in den Einstellungen.
el: Για την παροχή ζωντανής μετάφρασης ήχου, η εφαρμογή μας απαιτεί πρόσβαση στο μικρόφωνό σας. Παρακαλούμε δώστε άδεια στις ρυθμίσεις.
es: Para ofrecer traducción de audio en directo, nuestra aplicación necesita acceso a tu micrófono. Concede el permiso en la configuración.
et: Meie rakendus vajab otseülekande tegemiseks juurdepääsu teie mikrofonile. Palun andke luba seadetes.
fi: Suoran äänikäännöksen tarjoamiseksi sovelluksemme edellyttää pääsyä mikrofoniin. Anna lupa asetuksissa.
fr: Pour fournir une traduction audio en direct, notre application nécessite l'accès à votre microphone. Veuillez autoriser cet accès dans les paramètres.
hu: Az élő hangfordításhoz az alkalmazásunknak hozzáférést kell biztosítania az Ön mikrofonjához. Kérjük, adja meg az engedélyt a beállításokban.
id: Untuk menyediakan terjemahan audio langsung, aplikasi kami memerlukan akses ke mikrofon Anda. Mohon berikan izin di pengaturan.
it: Per fornire una traduzione audio dal vivo, la nostra app richiede l'accesso al vostro microfono. È necessario concedere l'autorizzazione nelle impostazioni.
ja: ライブ音声翻訳を提供するために、私たちのアプリはあなたのマイクにアクセスする必要があります。設定で許可を与えてください。
ko: 실시간 오디오 번역을 제공하려면 앱에서 마이크에 액세스할 수 있어야 합니다. 설정에서 권한을 부여하세요.
lt: Norint atlikti tiesioginį garso vertimą, mūsų programėlei reikalinga prieiga prie jūsų mikrofono. Suteikite leidimą nustatymuose.
lv: Lai nodrošinātu audio tulkojumu tiešraidē, mūsu lietotnei ir nepieciešama piekļuve jūsu mikrofonam. Lūdzu, piešķiriet atļauju iestatījumos.
nb: Appen vår krever tilgang til mikrofonen din for å kunne levere lydoversettelse i sanntid. Gi tillatelse i innstillingene.
nl: Om live audiovertaling te kunnen bieden, heeft onze app toegang tot uw microfoon nodig. Geef hiervoor toestemming in de instellingen.
pl: Aby zapewnić tłumaczenie audio na żywo, nasza aplikacja wymaga dostępu do mikrofonu. Proszę o zezwolenie w ustawieniach.
pt_pt: Para fornecer tradução de áudio ao vivo, nosso aplicativo requer acesso ao seu microfone. Por favor, conceda permissão nas configurações.
ro: Pentru a oferi traducere audio live, aplicația noastră necesită acces la microfon. Vă rugăm să acordați permisiunea în setări.
ru: Для обеспечения живого аудиоперевода нашему приложению требуется доступ к вашему микрофону. Пожалуйста, дайте разрешение в настройках.
sk: Na poskytovanie živého zvukového prekladu naša aplikácia vyžaduje prístup k vášmu mikrofónu. Udeľte povolenie v nastaveniach.
sl: Za zagotavljanje zvočnega prevoda v živo naša aplikacija potrebuje dostop do vašega mikrofona. Prosimo, dajte dovoljenje v nastavitvah.
sv: För att tillhandahålla liveljudöversättning kräver vår app tillgång till din mikrofon. Vänligen ge tillstånd i inställningarna.
tr: Canlı sesli çeviri sağlamak için uygulamamızın mikrofonunuza erişmesi gerekiyor. Lütfen ayarlardan izin verin.
uk: Щоб надати живий аудіопереклад, нашій програмі потрібен доступ до мікрофона. Надайте дозвіл у налаштуваннях.
zh_hans: 要提供实时音频翻译，我们的应用程序需要您的麦克风。请在设置中授予权限。
zh_hant: 為了提供即時音訊翻譯，我們的應用程式需要存取您的麥克風。 請在設定中授予權限。

source: Translate
ar: ترجمة
bg: Превод
cs: Přeložit
da: Oversæt
de: Übersetzen Sie
el: Μεταφράστε
es: Traducir
et: Tõlgi
fi: Käännä
fr: Traduire
hu: Fordítsd le
id: Menerjemahkan
it: Tradurre
ja: 翻訳する
ko: 번역
lt: Išversti
lv: Tulkot
nb: Oversett
nl: Vertaal
pl: Tłumaczenie
pt_pt: Traduzir
ro: Traducere
ru: Перевести
sk: Preložiť
sl: Prevesti
sv: Översätt
tr: Tercüme et
uk: Перекласти
zh_hans: 翻译
zh_hant: 翻譯

# translate.view.title
source: Translate
ar: ترجمة
bg: Превод
cs: Přeložit
da: Oversæt
de: Übersetzen Sie
el: Μεταφράστε
es: Traducir
et: Tõlgi
fi: Käännä
fr: Traduire
hu: Fordítsd le
id: Menerjemahkan
it: Tradurre
ja: 翻訳する
ko: 번역
lt: Išversti
lv: Tulkot
nb: Oversett
nl: Vertaal
pl: Tłumaczenie
pt_pt: Traduzir
ro: Traducere
ru: Перевести
sk: Preložiť
sl: Prevesti
sv: Översätt
tr: Tercüme et
uk: Перекласти
zh_hans: 翻译
zh_hant: 翻譯

source: whisper.cpp
ar: ويسبر.cpp
de: flüstern.cpp
ja: ささやき声.cpp
nl: fluister.cpp
ro: whisper

source: Yes
ar: نعم
bg: Да
cs: Ano
da: Ja
de: Ja
el: Ναι
es: Sí
et: Jah
fi: Kyllä
fr: Oui
hu: Igen
id: Ya.
it: Sì
ja: はい
ko: 예
lt: Taip
lv: Jā
nb: Ja
nl: Ja
pl: Tak
pt_pt: Sim
ro: Da
ru: Да
sk: Áno
sl: Da
sv: Ja
tr: Evet
uk: Так.
zh_hans: 确定
zh_hant: 是
